export const recommendQuestions: { [key: string]: string[] } = {
  development: [
    '최근 관심 있는 개발 이슈는 무엇인가요?',
    '기술 스택을 선택할 때 가장 중요하게 고려하는 요소는 무엇인가요?',
    '주니어 개발자가 성장을 위해 가져야하는 가장 중요한 태도가 무엇일까요?',
  ],
  product: [
    '프로젝트 관리 툴 중에서 가장 선호하는 것은 무엇인가요?',
    '새로운 아이디어를 발굴할 때 주로 어디서 영감을 얻으시나요?',
    '팀 내에서 기획안에 대한 피드백을 어떻게 수렴하고 반영하시나요?',
  ],
  design: [
    '요즘 주목하고 있는 디자인 트렌드는 무엇인가요?',
    '사용자 경험을 개선하기 위해 가장 중요하게 생각하는 요소는 무엇인가요?',
    '최근 읽은 디자인 관련 서적이나 블로그 포스트 중 추천할 만한 것이 있나요?',
  ],
  marketing: [
    '현재 주목하고 있는 마케팅 트렌드는 무엇인가요?',
    '주니어 마케터가 가져야 할 가장 중요한 역량은 무엇일까요?',
    '브랜드 인지도를 높이기 위한 전략 중 어떤 것이 가장 효과적이라고 생각하시나요?',
  ],
};
